<?php
$mass = array(

    '1' => array(
        0 => 'Тип личности',
        1 => 'Если на месте кляксы человек видит летучую мышь, которая ассоциируется с чем-то демоническим или неприятным, то это говорит о боязни внешнего мира и скрытых внутриличностных проблемах.',
        2 => 'Если при виде моли у человека возникает чувство опустошенности, это говорит об его уязвимости, а также о его неспособности устоять перед проблемами.',
        3 => 'Если на месте пятна тестируемый видит бабочку и при этом ощущает что-то позитивное, то это говорит о его способность расти, меняться и преодолевать трудности.',
        4 => 'Если на месте кляксы возникает образ мотылька, но при этом не возникает никаких ощущений, это говорит о том, что человек одинок, и в некоторой степени он испытывает ощущение заброшенности.',
        5 => 'Образ головы животного (чаще всего кошки) с чувством неопределенности говорит о боязни внешнего мира.'
    ),
    '2' => array(
        0 => 'Эмоциональное состояние человека',
        1 => 'Если картинка ассоциируется с двумя людьми, которые находятся в движении, это говорит о наличии тесных взаимоотношений с окружающими людьми.',
        2 => 'Ассоциация кляксы с отображением человека в зеркале, говорит о его эгоцентризме, нарциссизме, неспособности воспринимать критику.',
        3 => 'Если человек видит животного, чаще всего собаку, это указывает на то, что он верный друг.',
        4 => 'Если же он видит слона, это говорит о том, что человек склонен к раздумьям.',
        5 => 'Если картинка вызывает неприятные ощущения, нечто негативное, это говорит о том, что ему предстоит встретиться со своими страхами.',
        6 => 'Ассоциация пятна с медведем и нейтральными чувствами указывает на скрытую агрессию и неповиновение.',
        7 => 'Если тестируемый видит молящихся людей, а части красного интерпретируются им как кровь, это указывает на его амбивалентное (двойственное) отношение к сексу.',
        8 => 'Если он видит молящихся людей, но при этом испытывает сложные эмоции, это говорит о том, что религия ассоциируется у него с болью.',
        9 => 'Если тестируемый просто видит людей, а красный цвет интерпретирует как нечто сексуальное, это говорит о повышенном либидо.'
    ),
    '3' => array(
        0 => 'Социальные взаимодействия, отношение к окружающему миру',
        1 => 'Ассоциация клякс с двумя обедающими людьми, говорит о том, что в социальном плане тестируемый человек очень активен, он быстро адаптируется и не испытывает проблем с социальной интеграцией.',
        2 => 'Если на месте клякс возникает образ двух кукол (явление девитализации) – это указывает на то, что тестируемый удаленный от общества человек. Также это может быть признаком скудной эмоциональности, шизоидных черт личности.',
        3 => 'Если тестируемый человек видит двух людей, моющих руки, это указывает на наличие у него параноидального страха или навязчивых фобий.',
        4 => 'Если картинка напоминает человека, смотрящего в зеркало и, при этом, видящего свое изображение, это говорит об эгоцентризме и невнимательности к окружающим людям.',
        5 => 'Если пятно ассоциируется с двумя играющими между собой людьми, это указывает на тесные социальные взаимодействия, а также возможно на то, что человек непостоянен в своих решениях.',
        6 => 'Если тестируемый воспринимает картинку по частям, а не целиком, это говорит об узости его мышления или о наличии фобии (страха).',
    ),
    '4' => array(
        0 => 'Отношение к авторитетам',
        1 => 'На месте кляксы человек видит гигантского монстра, который вызывает в нем негативные эмоции. Это говорит о чувстве неполноценности тестируемого человека, о его преклонении перед авторитетом.',
        2 => 'Если картинка вызывает ассоциации со шкурой животного, это говорит о внутреннем противоречии, межличностных и внутриличностных конфликтах.',
        3 => 'Если же картинка напоминает мех или ковер из шкуры, это указывает на страх перед людьми, стоящих выше по карьерной или социальной лестнице, в том числе перед собственным отцом.'
    ),
    '5' => array(
        0 => 'Отражает «Я» человека.',
        1 => 'Если карточка 5 вызывает иные ассоциации, чем карточка 1, это говорит о том, что предыдущие картинки вызвали в тестируемом человеке сильный внутренний дискомфорт.',
        2 => 'Если карточка 5 вызывает аналогичные ассоциации, как и карточка 1, но без негативных эмоций, это указывает на глубокие личные проблемы.'
    ),
    '6' => array(
        0 => 'Отражает межличностную близость',
        1 => 'Если человек видит в пятне шкуру животного, это говорит о его нежелании вступать в тесные отношения с другими людьми.',
        2 => 'Если картинка ассоциируется с норой, это указывает на его изолированность от общества, на душевную пустоту.',
        3 => 'Если картинка вызывает у тестируемого различные страхи это говорит о скрытой депрессии.',
        4 => 'Если картинка ассоциируется с половым актом, и при этом вызывает ощущение шока у тестируемого, это говорит о наличии различных страхов сексуального содержания.'
    ),
    '7' => array(
        0 => 'В кругу специалистов эта карточка называется «женской».',
        1 => 'Если у тестируемого появляются трудности с интерпретацией образов на этой картинке, это говорит о его сложных отношениях с женским полом. Если тестируемый человек – женщина, то вышеперечисленная ассоциация указывает на конфликт с матерью.',
        2 => 'Ассоциация клякс с женскими головами или с детьми, указывает на обостренный материнский инстинкт, а также на необходимость в заботе, ласке.',
        3 => 'Ассоциация клякс с двумя головами готовыми к поцелую, говорит о желании быть любимым, о стремлении создать отношения.',
        4 => 'Ассоциация клякс с женскими половыми органами, говорит о сложностях в половой жизни.'
    ),
    '8' => array(
        0 => 'Самовыражение, эмоциональность',
        1 => 'Если при виде этой карточки, тестируемый испытывает трудности в ее интерпретации или впадает в ступор, это говорит о том, что он находится в сложной жизненной ситуации.',
        2 => 'Если в разноцветном пятне человек разглядывает четвероногое животное, и при этом не испытывает дискомфорта, это говорит о его расслабленности и эмоциональном спокойствии.',
        3 => 'Если на месте кляксы тестируемый видит не одно целое, а несколько образов (например, медведей и бабочек), то это говорит о его детализированном и фрагментарном мышлении, иногда о мелочности.'
    ),
    '9' => array(
        0 => 'Реакция на неопределенность.',
        1 => 'Если картинка ассоциируется с неопределенной формой зла, а человеческие образы отсутствуют, это говорит о том, что тестируемый плохо справляется с неопределенностями в жизни. Нестабильные ситуации выводят его из себя.',
        2 => 'Если клякса ассоциируется с человеком и при этом у тестируемого не возникает сложных ощущений при ее интерпретации, это говорит о его организованности, а также о том, что он хорошо умеет распоряжаться временем.'
    ),
    '10' => array(
        0 => 'Самая сложная по структуре и цветам карточка.',
        1 => 'Если данная карточка вызывает неопределенные или негативные ощущения, это указывает на то, что предыдущая картинка вызвала большие трудности.',
        2 => 'Позитивные эмоции и ассоциация с одновременно несколькими образами (гусеницами, крабами) говорит о целостности человеческой натуры, и развитом абстрактном мышлении.',
        3 => 'Если на картинке человек видит крабов и лобстеров, это говорит о том, что он склонен сильно привязываться к вещам, и обладает терпеливостью.',
        4 => 'Ассоциация клякс с пауками говорит о страхах, а также о том, что возможно человек вовлечен в сложную ситуацию.',
        5 => 'Если человек видит на картинке пауков и при этом испытывает внутреннее напряжение, это указывает на властную женщину в его жизни.',
        6 => 'Образ змеи говорит о том, что человек ощущает себя в опасности.',
        7 => 'Образ змеи, которая расценивается как фаллический символ, говорит о запретных сексуальных желаниях.',
        8 => 'Ассоциация картинки с гусеницей указывает на то, что человек постоянно растет и развивается.',
        9 => 'Ассоциация картинки с кроликом или его головой говорит о позитивном отношении к жизни.'
    )
);

$temp['answers'] = serialize($mass);
$json = json_encode($temp);
file_put_contents('/java/apache-tomcat-8.5.13/webapps/SeanceII/src/res/test_txt/answers.txt', $json);